<?php
echo strtotime("2017/12/31 23:59:59");
echo "<br>";
echo date ("Y-m-d H-i-s",1514764799);

echo "<br>"."1.ログ"."<br>";
echo "コンピュータの世界において何かを記録すること、あるいは、記録した物それ自体"."<br>"."Spotlightアイコンをクリックし、｢Console｣を検索。メニューの中から、コンソールアプリを開く。
左サイドバーの｢kernel.log｣をクリック。サイドバーが表示されないなら、｢ログリストを表示する｣をクリックして｢/private/var/log｣を開く。"."<br>";

echo "2.クラウドサーバー、レンタルサーバー、VPSの違い"."<br>";
echo "複数の仮想サーバーを個別で利用"."<br>"."１つの物理サーバーを複数ユーザーで共用"."<br>"."１つの仮想サーバー群を個別で利用"."<br>";

echo "3.PHPのFWの種類と特徴"."<br>";
echo "Laravel"."<br>"."わりやすいだけでなく、コードが書きやすく、直ぐに書き始められることなどが魅力。その他、日本語のドキュメントがあることやサポーターによるライブラリがたくさんあることが特徴"."<br>";
echo "CakePHP"."<br>"."有名なPHPフレームワークの1つで、ケーキを焼く様に簡単にPHPで開発ができるフレームワークを目指して開発されている MVCを採用していることやbakeコマンドによるプログラム自動生成機能があること、日本語に翻訳された優れたドキュメントの多いことなどが挙げられる";
echo "Symfony"."<br>"."オープンソースのPHP5用フレームワーク 毎年2回リリースアップされ、サポートについても明確なルールを持っているのが特徴";
echo "CodeIgniter"."コーディング規約への制限が緩く、自由度が高いという特徴がある";

?>